read_verilog good_mux.v
synth -top good_mux -flatten
abc -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
show
write_verilog -noattr synth_mux.v
stat -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
