read_liberty -lib ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog mult_8.v
synth -top mul8
abc -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
show
write_verilog -noattr synth_mul8.v
stat -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
