#submodule synthesis
read_verilog multiple_modules.v
synth -top sub_module1
dfflibmap -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
show
write_verilog -noattr synth_m_hier.v
stat -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
